# Brewfile - macOS package management via Homebrew Bundle
# Install: brew bundle install
# Check: brew bundle check

#------------------------------------------------------------------------------
# Core System Tools
#------------------------------------------------------------------------------

# Git - Distributed Version Control System
# Industry-standard distributed version control for tracking code changes,
# collaborating with teams, and managing project history with branches
brew "git"

# GNU Stow - Symlink Manager
# Elegant dotfiles manager that creates symlinks from a central repository
# to home directory, making config management simple and version-controllable
brew "stow"

# cURL - Data Transfer Tool
# Command-line tool for transferring data with URLs, supports HTTP, HTTPS,
# FTP and many protocols for downloading files and testing APIs
brew "curl"

# wget - Network Downloader
# Non-interactive network downloader for retrieving files via HTTP, HTTPS,
# and FTP with support for recursive downloads and resume capability
brew "wget"

# rsync - File Synchronization
# Fast incremental file transfer tool for synchronizing files and directories
# between locations with compression, preserving permissions and timestamps
brew "rsync"

#------------------------------------------------------------------------------
# Shell & Terminal
#------------------------------------------------------------------------------

# Starship - Cross-Shell Prompt
# Fast, customizable prompt for any shell with Git status, language versions,
# and extensive customization options written in Rust for performance
brew "starship"

# Zsh - Z Shell
# Powerful interactive shell with advanced features like auto-completion,
# spelling correction, and extensive customization via plugins and themes
brew "zsh"

# Vim - Vi IMproved
# Enhanced version of vi text editor with syntax highlighting, scripting,
# and extensive plugin ecosystem for efficient text editing
brew "vim"

# tmux - Terminal Multiplexer
# Terminal session manager enabling multiple windows, panes, and persistent
# sessions that survive disconnections, essential for remote work
brew "tmux"

#------------------------------------------------------------------------------
# GNU Core Utilities
#------------------------------------------------------------------------------

# GNU Coreutils - Core Unix Utilities
# Essential GNU versions of Unix commands (ls, cat, cp, mv, etc.) with more
# features and consistent behavior than BSD versions on macOS
brew "coreutils"

# GNU Findutils - File Search Utilities
# GNU versions of find, xargs, and locate with extended features for searching
# files and executing commands on search results
brew "findutils"

# GNU Sed - Stream Editor
# GNU version of sed for text transformations with extended regex support
# and consistent behavior across platforms for scripting reliability
brew "gnu-sed"

# GNU Tar - Archive Utility
# GNU version of tar for creating and extracting archives with better
# compression options and consistent behavior for portable scripts
brew "gnu-tar"

# GNU Which - Command Locator
# GNU version of which for locating executables in PATH with more reliable
# output format and better script integration capabilities
brew "gnu-which"

# GNU Indent - Code Formatter
# Formats C source code according to specified style guidelines with
# customizable indentation, brace placement, and spacing rules
brew "gnu-indent"

# GNU Getopt - Argument Parser
# GNU version of getopt for parsing command-line options with long option
# support and better error handling for shell script argument processing
brew "gnu-getopt"

#------------------------------------------------------------------------------
# Development Tools
#------------------------------------------------------------------------------

# GitHub CLI - GitHub Command Line
# Official GitHub command-line tool for managing PRs, issues, and repos
# directly from terminal without switching to browser
brew "gh"

# jq - JSON Processor
# Lightweight command-line JSON processor for parsing, filtering, and
# transforming JSON data with powerful query syntax
brew "jq"

# tree - Directory Visualizer
# Displays directory structure in tree format showing hierarchy with
# color coding and filtering options for understanding file organization
brew "tree"

# bat - Enhanced Cat
# Cat clone with syntax highlighting, Git integration, automatic paging,
# and line numbers for better code file viewing experience
brew "bat"

# ripgrep - Fast Search Tool
# Blazing fast search tool that recursively searches directories using
# regex patterns while respecting gitignore rules by default
brew "ripgrep"

# fd - Fast Find Alternative
# Simple, fast alternative to find with intuitive syntax, parallel execution,
# and respects gitignore for faster code searching
brew "fd"

# fzf - Fuzzy Finder
# Command-line fuzzy finder for files, command history, and any list input
# with instant feedback and integration with shell and vim
brew "fzf"

# htop - Interactive Process Viewer
# Interactive process viewer showing CPU, memory usage with color-coded
# meters and easy process management via keyboard shortcuts
brew "htop"

# Meld - Visual Diff Tool
# Visual diff and merge tool for comparing files and directories with
# three-way merge support and syntax highlighting
cask "meld"

#------------------------------------------------------------------------------
# Programming Languages & Version Managers
#------------------------------------------------------------------------------

# nvm - Node Version Manager
# Manages multiple Node.js versions allowing switching between projects
# with different Node requirements without conflicts
brew "nvm"

# pyenv - Python Version Manager
# Manages multiple Python versions and virtual environments for project
# isolation and testing across different Python versions
brew "pyenv"

#------------------------------------------------------------------------------
# Compression & Archives
#------------------------------------------------------------------------------

# p7zip - 7-Zip Archive Tool
# High compression ratio file archiver supporting 7z, ZIP, GZIP, BZIP2,
# and TAR formats with strong AES-256 encryption
brew "p7zip"

#------------------------------------------------------------------------------
# Browsers
#------------------------------------------------------------------------------

# Google Chrome - Web Browser
# Fast, secure web browser with extensive developer tools, wide extension
# ecosystem, and excellent standards support for modern web development
cask "google-chrome"

#------------------------------------------------------------------------------
# Development Applications
#------------------------------------------------------------------------------

# Visual Studio Code - Code Editor
# Powerful, extensible code editor with IntelliSense, debugging, Git integration,
# and thousands of extensions for any programming language
cask "visual-studio-code"

# iTerm2 - Terminal Emulator
# Feature-rich terminal replacement with split panes, search, profiles,
# and extensive customization for power users
cask "iterm2"

# Docker Desktop - Container Platform
# Containerization platform for building, shipping, and running applications
# in isolated environments with consistent behavior across systems
cask "docker-desktop"

# Claude - AI Desktop Application
# Anthropic's Claude AI desktop application for conversational AI assistance,
# research, writing, and general-purpose AI interactions
cask "claude"

# Claude Code - AI-Powered Development Environment
# Anthropic's Claude AI integrated development environment for AI-assisted
# coding with context-aware suggestions and natural language interactions
cask "claude-code"

# Gemini Code - Google AI Development Tool
# Google's Gemini AI coding assistant providing intelligent code completions,
# explanations, and refactoring suggestions powered by Gemini models
# cask "google-gemini"  # Not available in Homebrew

# act - Local GitHub Actions Runner
# Run GitHub Actions workflows locally for testing CI/CD pipelines before push,
# using Docker containers to simulate GitHub's runners environment
# brew "act"

#------------------------------------------------------------------------------
# Productivity Applications
#------------------------------------------------------------------------------

# Obsidian - Knowledge Management
# Markdown-based note-taking app with bidirectional linking, graph view,
# and local-first storage for building personal knowledge base
cask "obsidian"

# 1Password - Password Manager
# Secure password manager with browser integration, team sharing, and
# two-factor authentication for protecting credentials
cask "1password"

# 1Password CLI - Command Line Interface
# Command-line tool for accessing 1Password vaults, managing secrets,
# and integrating password management into scripts and workflows
cask "1password-cli"

#------------------------------------------------------------------------------
# Communication Applications
#------------------------------------------------------------------------------

# Slack - Team Communication
# Team collaboration platform with channels, direct messages, file sharing,
# and extensive app integrations for workplace communication
cask "slack"

# Discord - Community Chat
# Voice, video, and text chat platform originally for gaming communities,
# now widely used for project collaboration and communities
cask "discord"

# Zoom - Video Conferencing
# Video conferencing platform for meetings, webinars, and screen sharing
# with recording capabilities and virtual backgrounds
cask "zoom"

# WhatsApp - Messaging Application
# Cross-platform messaging app for text, voice, and video calls with
# end-to-end encryption and group chat capabilities
cask "whatsapp"

#------------------------------------------------------------------------------
# Media Applications
#------------------------------------------------------------------------------

# Spotify - Music Streaming
# Music streaming service with millions of songs, playlists, podcasts,
# and social features for discovering and sharing music
cask "spotify"

# VLC - Media Player
# Free, open-source multimedia player supporting virtually all video and
# audio formats with streaming and conversion capabilities
cask "vlc"

#------------------------------------------------------------------------------
# AI & Productivity Tools
#------------------------------------------------------------------------------

# ChatGPT - AI Assistant
# Desktop application for OpenAI's ChatGPT providing AI-powered assistance
# for writing, coding, research, and problem-solving tasks
cask "chatgpt"

#------------------------------------------------------------------------------
# Cloud Storage & Sync
#------------------------------------------------------------------------------

# Dropbox - File Synchronization
# Cloud storage and file synchronization service for backing up files,
# sharing folders, and collaborating on documents across devices
cask "dropbox"

#------------------------------------------------------------------------------
# Security & Privacy
#------------------------------------------------------------------------------

# ExpressVPN - VPN Service
# Virtual private network service for encrypting internet connection,
# protecting privacy, and accessing geo-restricted content
cask "expressvpn"

#------------------------------------------------------------------------------
# Fonts
#------------------------------------------------------------------------------

# Fira Code Nerd Font - Programming Font
# Monospaced font with programming ligatures and additional glyphs for
# terminal and editor use with better code readability
cask "font-fira-code-nerd-font"

# JetBrains Mono Nerd Font - Programming Font
# Modern monospaced font designed for developers with increased height for
# better readability and ligature support for common code patterns
cask "font-jetbrains-mono-nerd-font"

#------------------------------------------------------------------------------
# Fun & Miscellaneous
#------------------------------------------------------------------------------

# fortune - Random Quote Generator
# Classic Unix program that displays random quotations, jokes, and sayings
# for adding personality to shell sessions and MOTDs
brew "fortune"

#------------------------------------------------------------------------------
# Optional Applications (Commented Out)
#------------------------------------------------------------------------------

# Alfred - Application Launcher & Productivity
# Powerful macOS launcher with workflows, clipboard history, snippets,
# and system control for keyboard-driven productivity
# cask "alfred"

# Rectangle - Window Management
# Window manager for organizing windows via keyboard shortcuts with snapping
# to screen edges and corners for efficient screen space usage
# cask "rectangle"
